Tekla Open API Reference for Tekla Structures 2025
PluginPickerInput Constructor
Overload List
Name | Description
PluginPickerInput()
 Initializes a new instance of the PluginPickerInput class with an empty list of picker inputs.
PluginPickerInput(List<PickerInput>)
 Initializes a new instance of the PluginPickerInput class which contains a predefined sequence of inputs.
Top
See Also
Reference
PluginPickerInput Class
Tekla.Structures.Drawing Namespace